[
  {
    "version": "1.6",
    "date": "2025-11-10",
    "highlights": [
      "Refined the portal home",
      "Added quick access, data sources and analysis options cards.",
      "Introduced  UWM IPIT and WisDOT logos in the footer with new styling that showcases program partners."
    ]
  },
  {
    "version": "1.5",
    "date": "2025-11-06",
    "highlights": [
      "Live detection now overlays per-crosswalk pedestrian and cyclist totals directly on the video feed, pairing the stream with dedicated count cards for each virtual line.",
      "Operators can fine-tune crosswalk placement with new move, rotate, and resize controls that adjust each line in small increments for precise calibration.",
      "Video tracking keeps stable IDs across frames so repeated detections are avoided while counts update in real time."
    ]
  },
  {
    "version": "1.4",
    "date": "2025-11-05",
    "highlights": [
      "Added logo to the portal header for stronger branding."
      ]
  },
  {
    "version": "1.3",
    "date": "2025-11-04",
    "highlights": [
      "The AccSafety portal at accsafety.uwm.edu now loads over HTTPS ensuring security.",
      "Unified Explore now keeps a Dataset Snapshot beside the map so you can review top locations and totals without leaving the results view.",
      "The location distribution donut chart highlights percent share values directly on the graphic for quicker comparisons.",
      "Links that open ECO dashboards now carry over the selected mode, ensuring shared URLs and Explore shortcuts land on the right pedestrian or bicyclist view."
    ]
  },
  {
    "version": "1.2",
    "date": "2025-10-30",
    "highlights": [
      "Added a dedicated What's New page inside the portal so partners can review the latest updates without leaving the app.",
      "Switched the What's New source to a checked-in JSON file so deployments without Git metadata still surface release notes."
    ],
    "links": [
      {
        "label": "View the portal What's New page",
        "url": "/whats-new"
      }
    ]
  },
  {
    "version": "1.1",
    "date": "2025-10-29",
    "highlights": [
      "Replaced the Unified Explore basemap with an ArcGIS embed for faster loading and consistent layer styling across corridors.",
      "Simplified the explore view by removing heavy Plotly dependencies while preserving the key corridor analytics."
    ]
  },
  {
    "version": "1.0",
    "date": "2025-10-28",
    "highlights": [
      "Enabled shareable Vivacity dashboard links that remember the selected mode and sensor context.",
      "Expanded the default Vivacity selection so new viewers immediately see representative corridors.",
      "Grouped Vivacity time-series charts by direction to make northbound and southbound trends easier to compare."
    ]
  }
]
